"""
Напишите программу, которая считывает с консоли числа (по одному в строке) до тех пор,
пока сумма введённых чисел не будет равна 0 и сразу после этого выводит сумму квадратов всех считанных чисел.

Гарантируется, что в какой-то момент сумма введённых чисел окажется равной 0,
после этого считывание продолжать не нужно.

В примере мы считываем числа 1, -3, 5, -6, -10, 13;
в этот момент замечаем, что сумма этих чисел равна нулю и выводим сумму их квадратов,
не обращая внимания на то, что остались ещё не прочитанные значения.﻿

Sample Input:
1
-3
5
-6
-10
13
4
-8

Sample Output: 340
"""

a = int(input())
sum = a
lst = []
lst.append(a)
s = 0
while sum != 0:
    a = int(input())
    sum = sum + a
    lst.append(a)

for i in lst:
    s = s + i ** 2

print(s)

# Короткий вариант:

s = [int(input())]
while sum(s) != 0:
    s.append(int(input()))
print(sum([i ** 2 for i in s]))
